; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v1 - type_3 ?v2 - type_2)
 	      (pred_3 ?v6 - object ?v2 - type_2)
	      (pred_1 ?v1 - type_3 ?v3 - type_1)
	      (pred_4 ?v1 - type_3 ?v6 - object ?v3 - type_1))

   (:action op_1
       :parameters  (?v1 - type_3 ?v4 ?v7 - type_2)
       :precondition (and  (pred_2 ?v1 ?v4))
       :effect (and  (pred_2 ?v1 ?v7)
		     (not (pred_2 ?v1 ?v4))))

   (:action op_2
       :parameters (?v1 - type_3 ?v5 - object ?v8 - type_2 ?v3 - type_1)
       :precondition  (and  (pred_3 ?v5 ?v8) (pred_2 ?v1 ?v8) (pred_1 ?v1 ?v3))
       :effect (and (pred_4 ?v1 ?v5 ?v3)
		    (not (pred_3 ?v5 ?v8)) 
		    (not (pred_1 ?v1 ?v3))))

   (:action op_3
       :parameters (?v1 - type_3 ?v5 - object ?v8 - type_2 ?v3 - type_1)
       :precondition  (and  (pred_4 ?v1 ?v5 ?v3) (pred_2 ?v1 ?v8))
       :effect (and (pred_3 ?v5 ?v8)
		    (pred_1 ?v1 ?v3)
		    (not (pred_4 ?v1 ?v5 ?v3)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_11 obj_13 - type_3
obj_03 obj_09 obj_06 obj_10 - type_1
obj_08 obj_04 obj_02 obj_12 - type_2
obj_01 obj_07 obj_05 - object)
(:init
(pred_2 obj_11 obj_04)
(pred_1 obj_11 obj_03)
(pred_1 obj_11 obj_09)
(pred_2 obj_13 obj_02)
(pred_1 obj_13 obj_06)
(pred_1 obj_13 obj_10)
(pred_3 obj_01 obj_02)
(pred_3 obj_07 obj_08)
(pred_3 obj_05 obj_02)
)
(:goal
(and
(pred_3 obj_01 obj_04)
(pred_3 obj_07 obj_08)
(pred_3 obj_05 obj_12)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_11 obj_04) (pred_2 obj_13 obj_04))))
  )
)
)

; plan
1. (op_2 obj_13 obj_01 obj_02 obj_10)
   deleted: (pred_3 obj_01 obj_02) (pred_1 obj_13 obj_10)
   added: (pred_4 obj_13 obj_01 obj_10)
   goals met: 1 of 3
2. (op_2 obj_13 obj_05 obj_02 obj_06)
   deleted: (pred_3 obj_05 obj_02) (pred_1 obj_13 obj_06)
   added: (pred_4 obj_13 obj_05 obj_06)
   goals met: 1 of 3
3. (op_1 obj_11 obj_04 obj_08)
   deleted: (pred_2 obj_11 obj_04)
   added: (pred_2 obj_11 obj_08)
   goals met: 1 of 3
4. (op_1 obj_13 obj_02 obj_12)
   deleted: (pred_2 obj_13 obj_02)
   added: (pred_2 obj_13 obj_12)
   goals met: 1 of 3
5. (op_3 obj_13 obj_05 obj_12 obj_06)
   deleted: (pred_4 obj_13 obj_05 obj_06)
   added: (pred_3 obj_05 obj_12) (pred_1 obj_13 obj_06)
   goals met: 2 of 3
6. (op_1 obj_13 obj_12 obj_04)
   deleted: (pred_2 obj_13 obj_12)
   added: (pred_2 obj_13 obj_04)
   goals met: 2 of 3
7. (op_3 obj_13 obj_01 obj_04 obj_10)
   deleted: (pred_4 obj_13 obj_01 obj_10)
   added: (pred_3 obj_01 obj_04) (pred_1 obj_13 obj_10)
   goals met: 3 of 3
